<?php require 'functions_for_themes.php'; ?>
<!DOCTYPE html>
<html lang="en">
    <head>
        <title>Document</title>
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <meta charset="UTF-8">
        <!-- bootstrap -->
        <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/css/bootstrap.min.css" integrity="sha384-TX8t27EcRE3e/ihU7zmQxVncDAy5uIKz4rEkgIXeMed4M0jlfIDPvg6uqKI2xXr2" crossorigin="anonymous">
        <script src="https://cdn.jsdelivr.net/npm/bootstrap@4.5.3/dist/js/bootstrap.bundle.min.js" integrity="sha384-ho+j7jyWK8fNQe+A12Hb8AhRq26LrZ/JpcUGGOn+Y7RsweNrtN/tE3MoK7ZeZDyx" crossorigin="anonymous"></script>
        <!-- ========= -->
        <?php require 'meta.php'; ?>
        <style>
            div.user-agreement-main-container {
                padding: 46px 199px;
                font-size: 1.2em;
                background-color: #1c2434;
                color: #c7c7c7;
            }

            div.user-agreement-main-container ul {
                text-align: justify;
            }
        </style>
    </head>
<body>
    <div class="superMain">
        <?php require 'head.php'; ?>
        <div class="user-agreement-main-container">
            <h1>Соглашение по использованию сайта</h1>
            <p>Настоящее Соглашение заключено между Сухачевым Егором Геннадиевичем далее – (ЕС) 
                и любым Пользователем (далее совместно именуемые - Стороны) 
                официального сайта ЕС (www.egorsukhachev.com) (далее – Сайт).
            </p>
            <h2>Общие положения</h2>
            <ul>
                <li>
                    ЕС обеспечивает функционирование Сайта в целях удовлетворения потребностей Пользователей 
                    в различной информации. 
                    Все сведения и данные, находящиеся на Сайте и его разделах носят исключительно 
                    информационное назначение. ЕС призывает Пользователей посещать Сайт, 
                    копировать и производить выгрузку информации, документов, файлов (далее – Материалы сайта) 
                    предоставляемых ЕС на Сайте, для личного использования, 
                    без предоставления каких-либо прав на любое коммерческое использование 
                    Материалов сайта или их производных, в соответствии с условиями настоящего Соглашения.
                </li>
            
                <li>
                    Вся информация, размещенная на Сайте, включая (без каких-либо ограничений) 
                    графические изображения, текстовые материалы и ссылки на другие сайты, 
                    предоставляется по принципу «как есть» и может быть изменена 
                    без предварительного на то уведомления. Такая информация предоставляется 
                    в объеме, максимально допустимом в соответствии с действующим законодательством, 
                    без каких-либо прямо или косвенно выраженных гарантий, включая (без каких-либо ограничений) 
                    гарантии товарного качества, соответствия, отсутствия компьютерного вируса или аналогичных 
                    блокирующих средств.
                </li>
            
                <li>
                    Логотип, встречающийся на Сайте, 
                    является собственностью ЕС. 
                    Пользователям запрещается использование логотипа 
                    без предварительного письменного согласия ЕС.
                </li>
            
                <li>
                    Факт посещения сайта/использования Материалов сайта 
                    Пользователем подтверждает его ознакомление, понимание и согласие 
                    с условиями настоящего Соглашения в полном объеме без изъятий и ограничений.
                </li>
            
                <li>
                    Если специально не оговорено иное, выводы, толкования и заключения, 
                    содержащиеся в Материалах сайта выражают точку зрения авторов 
                    и не являются обязательными для ЕС.
                </li>
            </ul>
            <h2>Ограничение ответственности</h2>

            <ul>
                <li>
                ЕС приложит все разумные усилия для того, чтобы информация, 
                    размещаемая на Сайте, была верной и своевременно обновлялась. 
                    При этом ЕС не может гарантировать отсутствие некоторых неточностей и ошибок, 
                    которые могут появляться на Сайте время от времени. ЕС не несет 
                    и не будет нести какой-либо ответственности 
                    (в силу договорных, гражданских или иных правоотношений) за возникновение 
                    каких-либо прямых, косвенных, случайных, опосредованных, 
                    штрафных или иных убытков в результате получения доступа, 
                    ознакомления или пользования информацией, размещенной на настоящем Сайте или иным образом, 
                    связанным с настоящим Сайтом, 
                    вне зависимости от того, было ли известно ЕС 
                    о возможности наступления таких убытков или нет.

                </li>
            
                <li>
                    Все риски, возникающие при использовании Сайта, несет Пользователь. 
                    ЕС ни при каких условиях не несет ответственности за любые понесенные 
                    Пользователем убытки, в чем бы они ни состояли, в том числе, 
                    в случае если ЕС был уведомлен о возможности причинения убытков.
                </li>
            
                <li>
                    Риск наступления негативных последствий 
                    в результате использования содержащихся на сайте рекомендаций, 
                    мнений и утверждений, в полном объеме несет Пользователь. 
                    ЕС не гарантирует и не подтверждает 
                    точность и достоверность содержащихся на сайте рекомендаций, мнений и утверждений.
                </li>
            
                <li>
                    ЕС, его аффилированные лица или должностные лица 
                    не несут никакой ответственности за любые ошибки, неточности, 
                    потери времени, нарушения в работе оборудования и линий коммуникаций, 
                    проникновения компьютерных вирусов, потери и изменения данных, возникновения 
                    дефектов в работе программ возникших, независимо от причин, в результате использования Сайта.
                </li>
            
                <li>
                    <ul>
                        <h3>Ни одно из положений Сайта не является и не может быть истолковано как:</h3>
                        <ul>
                        <li>рекомендация юридическим или физическим лицам 
                            по распоряжению имуществом (имущественными правами);
                        </li>
                        <li>предложение по купле-продаже любого имущества (имущественных прав).</li>
                        <li>публичная оферта в соответствии с п.2 ст.437 ГК РФ 
                            (если иное прямо не указано в размещенной на Сайте информации)
                        </li>
                    </ul>
                </li>
            </ul>

            <h2>Изменение и дополнения</h2>

            <ul>
                <li>
                    <ul>
                        <h3>ЕС оставляет за собой право по своему выбору 
                            без предварительного уведомления и/или разъяснения причин:
                        </h3>
                        <li>
                            изменять, исправлять, ограничивать, приостанавливать или прекращать действие Сайта 
                            и любых его разделов (Материалов);
                        </li>
                        <li>
                            отказывать любому Пользователю в доступе к пользованию Сайтом и /или любому его разделу.
                        </li>
                    </ul>
                </li>
                <li>
                    Удовлетворение/рассмотрение потребностей Пользователя 
                    при использовании Сайта не является обязанностью ЕС.
                </li>
            </ul>

            <h2>Заявления Пользователя</h2>

            <ul>
                <li>
                    <ul>
                        <h3>Пользователь специально уведомлен и подтверждает, что:</h3>
                        <li>ЕС не несет ответственности за любые действия любого Пользователя;</li>
                        <li>
                            исключительным условием пользования Сайтом является всемерное 
                            предотвращение Пользователем любых возможных убытков, долгов и расходов 
                            (включая судебные издержки), прямых или опосредованных, 
                            способных возникнуть у ЕС в результате нарушения Пользователем данного Соглашения;
                        </li>
                        <li>
                            все права на содержащиеся в Материалах сайта результаты интеллектуальной деятельности, 
                            на все данные, расположенные во всех его разделах, если иное не предусмотрено законом 
                            или договором, принадлежат ЕС;
                        </li>
                        <li>
                            Пользователь не изменяет и не предпринимает попыток изменить 
                            любые характеристики Сайта и/или содержание материалов Сайта.
                        </li>
                    </ul>
                </li>
            </ul>

            <h2>Интернет-ссылки</h2>

            <ul>
                <li>
                    Сайт может содержать ссылки на иные Интернет - сайты. 
                    Такие сайты не находятся под контролем ЕС, и ЕС 
                    не несет ответственности за содержание таких сайтов и/или содержание сайтов, 
                    ссылки на которые находятся на таких сайтах. Ссылки на иные сайты включены в 
                    Сайт только для удобства Пользователей и не означают согласие ЕС 
                    и его должностных лиц с содержанием таких сайтов.
                </li>
                <li>
                    Иные Интернет–сайты могут содержать ссылки на Сайт без специального разрешения ЕС. 
                    Такие ссылки должны однозначно определять ЕС как первоисточник 
                    содержащейся на Сайте информации и обеспечить доступ к Сайту без 
                    возможности внесения изменений в Материалы сайта и /или любые иные его характеристики.
                </li>

            </ul>

            <h2>Форумы</h2>

            <p>
                Сайт может содержать разделы для голосования, размещения объявлений, 
                обсуждения в режиме реального времени (чаты), иные разделы для направления 
                сообщений или средства связи (далее совместно – Форумы). Пользование Форумами 
                осуществляется только для отправки и получения сообщений и материалов в 
                соответствии с тематикой и характеристиками каждого Форума. 
                <!-- Пользователи принимают на себя обязательства не совершать действий, 
                способных привести к нарушению условий настоящего Соглашения, например: -->
            </p>
            <!-- <ul>
                <li>
                    распространять клевету, наносить оскорбления, как группе лиц, так и частным 
                    лицам физическим или юридическим; угрожать, любым иным способом нарушать права и 
                    интересы других лиц, а также иным способом нарушать общепринятые нормы общения;
                </li>
                <li>
                    публиковать, помещать в качестве сообщения, 
                    распространять любым иным способом любые дискредитирующие, недостоверные, 
                    непристойные, противоправные материалы и информацию, в отношении любого лица;
                </li>
                <li>
                    загружать или присоединять файлы, содержащие в себе материалы, 
                    данные охраняемые законодательством об авторских правах и правах 
                    на результаты интеллектуальной деятельности, за исключением случаев наличия у 
                    Пользователя соответствующих прав;
                </li>
                <li>
                    загружать или присоединять файлы, содержащие компьютерные вирусы, 
                    искаженные или испорченные файлы или любые иные файлы и программы, 
                    способные, в том числе при ненадлежащем использовании, нарушить работу компьютера;
                </li>
                <li>
                    уничтожать содержащиеся в Материалах сайта данные, указывающие на авторство, 
                    правообладание, маркировку;
                </li>
                <li>
                    рекламировать или предлагать к продаже любые товары или услуги, вести необоснованную 
                    полемику иным образом использовать Форум не по назначению;
                </li>
                <li>
                    осуществлять копирование/загрузку материалов, размещенных другим Пользователем, 
                    о которых известно и/или, исходя из разумных предпосылок, должно быть известно, 
                    что их распространение запрещено.
                </li>
                <li>
                    Пользователи уведомлены и согласны с тем, что Форумы созданы для публичного, 
                    а не частного общения. Также, Пользователи уведомлены и согласны с тем, что все материалы, 
                    размещаемые Пользователями в Форумах, не поддерживаются и не подтверждаются ЕС, 
                    а также не являются объектом рассмотрения, проверки и оценки со стороны ЕС.
                </li>
                <li>
                    Пользователи принимают условие о том, 
                    что у ЕС отсутствуют обязательства по контролю за 
                    результатами использования Форумов, а также условие о том, что 
                    использование Форумов осуществляется на основании принимаемых ЕС 
                    в любое время на свое усмотрение и без предварительного уведомления 
                    инструктивных/нормативных документов.
                </li>
                <li>
                    ЕС оставляет за собой право редактирования любых размещаемых в 
                    Форумах материалов без разрешения или уведомления Пользователей.
                </li>
            </ul> -->
            <!-- <h2>Властные ограничения</h2> -->

            <!-- <p>
                В случае если компетентными органами/лицами часть настоящего соглашения будет признана 
                недействительной, противоречащей законодательству и не подлежащей применению, 
                это не влечет невозможность применения остальных положений настоящего Соглашения. 
                Настоящее Соглашение действует в полной мере в рамках, устанавливаемых действующим законодательством. 
                ЕС оставляет за собой право заменить положения признанные неприменяемыми, иными, 
                соответствующими требованиям действующего на тот момент законодательства.
            </p> -->

            <h2>Изменения и дополнения</h2>

            <p>
                Изменения и дополнения к настоящему Соглашению имеют юридическую силу только 
                в случае их письменного закрепления и подписания от имени ЕС 
                надлежаще уполномоченным лицом.
            </p>

            <!-- <h2>Окончательность и полнота Соглашения</h2>
            <ul>
                <li>
                    Настоящее Соглашение – окончательный и полный документ, 
                    регулирующий отношения Сторон по поводу предмета настоящего соглашения и отменяет 
                    все предыдущее договоренности в этом отношении, письменные или устные.
                </li>
                <li>
                    Пользователь подтверждает, что ни одно условие, оговоренное Сторонами, 
                    не осталось за рамками настоящего Соглашения.
                </li>
            </ul> -->
            <h2>Несогласие Пользователя</h2>

            <p>
                В случае несогласия Пользователя с любым из условий настоящего Соглашения 
                он обязан немедленно прекратить использования Сайта и/или любого из его разделов.
            </p>

            <!-- <h2>Применимое право</h2>

            <p>
                К отношениям в рамках настоящего Соглашения применяется право Российской Федерации.
            </p> -->
        </div>
        <?php require 'footer.php' ?>
    </div>
</body>
</html>

